#4. Пользователь вводит целое положительное число. 
#Найдите самую большую цифру в числе. 
#Для решения используйте цикл while и арифметические операции.

#Str в питоне это последовательность из символов (P.s типа char как такогого нету). К этой последовательности можно применить функцию max() и обойтись без лишних действий.

print("Самая большая цифра в числе: %s" % max((input("Введите число: "))))