# 2. Во втором массиве сохранить индексы четных элементов первого массива. Например, если дан массив 
# со значениями 8, 3, 15, 6, 4, 2, второй массив надо заполнить значениями 0, 3, 4, 5, (индексация начинается с нуля), т.к. 
# именно в этих позициях первого массива стоят четные числа.

import random

r = [random.randint(0, 100) for _ in range(10)]
index_even = []

for n in r:
    if n % 2 == 0:
        index_even.append(r.index(n))

print(*["Массив:", *r])
print(*["Результат:", *index_even])